In [1]:
import pandas as pd

Pandas is a Python module for working with tabular data (i.e., data in a table with rows and columns). Tabular data has a lot of the same functionality as SQL or Excel, but Pandas adds the power of Python.

Pandas is built on dataframes.
A DataFrame is an object that stores data as rows and columns. You can think of a DataFrame as a spreadsheet or as a SQLDataFrames have rows and columns. Each column has a name, which is a string. Each row has an index, which is an integer. DataFrames can contain many different data types: strings, ints, floats, tuples, etc. table. You can manually create a DataFrame or fill it with data from a CSV, an Excel spreadsheet, or a SQL query.

In [3]:
#Create a dataframe using dictionary
df1 = pd.DataFrame({
  'Product ID': [1, 2, 3, 4],
  # add Product Name and Color here
  'Product Name':['t-shirt','t-shirt','skirt','shirt'],
  'Color':['blue','green','red','black']
})

print(df1)

   Product ID Product Name  Color
0           1      t-shirt   blue
1           2      t-shirt  green
2           3        skirt    red
3           4        shirt  black

In [4]:
#Create a dataframe using lists
df2 = pd.DataFrame([
  [1, 'San Diego', 100],
  [2, 'Los Angeles', 120],
  [3, 'San Francisco', 90],
  [4, 'Sacramento', 115]
],
  columns = [
    'Store ID', 'Location', 'Number of Employees'
  ])

print(df2)

   Store ID       Location  Number of Employees
0         1      San Diego                  100
1         2    Los Angeles                  120
2         3  San Francisco                   90
3         4     Sacramento                  115

Most of the time we will be working with datasets from external files like CSV,Excel,Feather etc

In [5]:
#Read csv
df = pd.read_csv('world_ind_pop_data.csv')

In [6]:
#Print first 5 rows
df.head()

,CountryName,CountryCode,Year,Total Population,Urban population (% of total)
0,Arab World,ARB,1960,9.249590e+07,31.285384
1,Caribbean small states,CSS,1960,4.190810e+06,31.597490
2,Central Europe and the Baltics,CEB,1960,9.140158e+07,44.507921
3,East Asia & Pacific (all income levels),EAS,1960,1.042475e+09,22.471132
4,East Asia & Pacific (developing only),EAP,1960,8.964930e+08,16.917679

In [7]:
#last 5 rows
df.tail()

,CountryName,CountryCode,Year,Total Population,Urban population (% of total)
13369,Virgin Islands (U.S.),VIR,2014,104170.0,95.203
13370,West Bank and Gaza,WBG,2014,4294682.0,75.026
13371,"Yemen, Rep.",YEM,2014,26183676.0,34.027
13372,Zambia,ZMB,2014,15721343.0,40.472
13373,Zimbabwe,ZWE,2014,15245855.0,32.501

In [8]:
#info about the dataframe created
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13374 entries, 0 to 13373
Data columns (total 5 columns):
CountryName                      13374 non-null object
CountryCode                      13374 non-null object
Year                             13374 non-null int64
Total Population                 13374 non-null float64
Urban population (% of total)    13374 non-null float64
dtypes: float64(2), int64(1), object(2)
memory usage: 522.5+ KB

A dataframe is made of rows and columns. Each column is called a series .

In [9]:
#Selecting a column
CountryName = df.CountryName #Can also use df["CountryName"]

In [11]:
CountryName.head()

0                                 Arab World
1                     Caribbean small states
2             Central Europe and the Baltics
3    East Asia & Pacific (all income levels)
4      East Asia & Pacific (developing only)
Name: CountryName, dtype: object

In [13]:
#Create a new dataframe which is a sub dataframe of the current one
country_info = df[["CountryName","CountryCode"]]

Selecting a single row. Panda dataframes are indexed similar to numpy arrays.

In [15]:
#select 3rd row
df.iloc[2]

CountryName                      Central Europe and the Baltics
CountryCode                                                 CEB
Year                                                       1960
Total Population                                    9.14016e+07
Urban population (% of total)                           44.5079
Name: 2, dtype: object

In [16]:
type(df.iloc[2])

pandas.core.series.Series

Selecting based on logical conditions

In [17]:
df3 = pd.DataFrame([
  ['January', 100, 100, 23, 100],
  ['February', 51, 45, 145, 45],
  ['March', 81, 96, 65, 96],
  ['April', 80, 80, 54, 180],
  ['May', 51, 54, 54, 154],
  ['June', 112, 109, 79, 129]],
  columns=['month', 'clinic_east',
           'clinic_north', 'clinic_south',
           'clinic_west'])

january = df3[df3.month == "January"]

In [18]:
january

     month  clinic_east  clinic_north  clinic_south  clinic_west
0  January          100           100            23          100

In [21]:
march_april = df3[(df3.month == "March") | (df3.month == "April")]
print(march_april)

   month  clinic_east  clinic_north  clinic_south  clinic_west
2  March           81            96            65           96
3  April           80            80            54          180

In [22]:
january_february_march = df3[df3.month.isin(["January","February","March"])]
print(january_february_march)

      month  clinic_east  clinic_north  clinic_south  clinic_west
0   January          100           100            23          100
1  February           51            45           145           45
2     March           81            96            65           96

Applying functions on rows and columns using Pandas

In [23]:
orders = pd.read_csv('shoefly.csv')
orders.head()

,id,first_name,last_name,gender,email,shoe_type,shoe_material,shoe_color
0,54791,Rebecca,Lindsay,female,RebeccaLindsay57@hotmail.com,clogs,faux-leather,black
1,53450,Emily,Joyce,female,EmilyJoyce25@gmail.com,ballet flats,faux-leather,navy
2,91987,Joyce,Waller,female,Joyce.Waller@gmail.com,sandles,fabric,black
3,14437,Justin,Erickson,male,Justin.Erickson@outlook.com,clogs,faux-leather,red
4,79357,Andrew,Banks,male,AB4318@gmail.com,boots,leather,brown

In [26]:
#apply a function to create a new column to provide shoe source as either vegan or animal based on show_material column
mylambda = lambda x: 'animal' \
           if x == 'leather' else 'vegan'
orders['shoe_source'] = orders.shoe_material.apply(mylambda)

In [27]:
orders.head()

,id,first_name,last_name,gender,email,shoe_type,shoe_material,shoe_color,shoe_source
0,54791,Rebecca,Lindsay,female,RebeccaLindsay57@hotmail.com,clogs,faux-leather,black,vegan
1,53450,Emily,Joyce,female,EmilyJoyce25@gmail.com,ballet flats,faux-leather,navy,vegan
2,91987,Joyce,Waller,female,Joyce.Waller@gmail.com,sandles,fabric,black,vegan
3,14437,Justin,Erickson,male,Justin.Erickson@outlook.com,clogs,faux-leather,red,vegan
4,79357,Andrew,Banks,male,AB4318@gmail.com,boots,leather,brown,animal

In [37]:
salutation_lambda = lambda row: \
  'Dear Mr. {}'.format(row.last_name) \
    if row['gender'] == 'male' \
    else 'Dear Ms. {}'.format(row.last_name)

In [41]:
orders['salutation'] = orders.apply(lambda row: \
  'Dear Mr. {}'.format(row.last_name) \
    if row.gender == 'male' \
    else 'Dear Ms. {}'.format(row.last_name),
                                   axis=1)

In [32]:
orders.gender

0     female
1     female
2     female
3       male
4       male
5     female
6       male
7     female
8       male
9     female
10    female
11      male
12    female
13    female
14    female
15    female
16      male
17      male
18      male
19    female
Name: gender, dtype: object

In [42]:
orders.head()

,id,first_name,last_name,gender,email,shoe_type,shoe_material,shoe_color,shoe_source,salutation
0,54791,Rebecca,Lindsay,female,RebeccaLindsay57@hotmail.com,clogs,faux-leather,black,vegan,Dear Ms. Lindsay
1,53450,Emily,Joyce,female,EmilyJoyce25@gmail.com,ballet flats,faux-leather,navy,vegan,Dear Ms. Joyce
2,91987,Joyce,Waller,female,Joyce.Waller@gmail.com,sandles,fabric,black,vegan,Dear Ms. Waller
3,14437,Justin,Erickson,male,Justin.Erickson@outlook.com,clogs,faux-leather,red,vegan,Dear Mr. Erickson
4,79357,Andrew,Banks,male,AB4318@gmail.com,boots,leather,brown,animal,Dear Mr. Banks

In [46]:
inventory = pd.read_csv('inventory.csv')
#print(inventory.head(10))
#staten_island = inventory[0:10]
staten_island = inventory[(inventory.location == "Staten Island")]
#print(staten_island)
product_request = staten_island.product_description
seed_request = inventory[(inventory.location == 'Brooklyn') & (inventory.product_type == 'seeds')]
print(seed_request)
inventory['in_stock'] = inventory.quantity.apply(lambda x: \
     True \
     if x > 0 else False                                           )
print(inventory.head(10))
inventory['total_value'] = inventory.price * inventory.quantity

    location product_type product_description  quantity  price
10  Brooklyn        seeds               daisy        50   6.99
11  Brooklyn        seeds          calla lily         0  19.99
12  Brooklyn        seeds              tomato         0  13.99
        location  product_type         product_description  quantity  price  \
0  Staten Island         seeds                       daisy         4   6.99
1  Staten Island         seeds                  calla lily        46  19.99
2  Staten Island         seeds                      tomato        85  13.99
3  Staten Island  garden tools                        rake         4  13.99
4  Staten Island  garden tools                 wheelbarrow         0  89.99
5  Staten Island  garden tools                       spade        93  19.99
6  Staten Island  pest_control               insect killer        74  12.99
7  Staten Island  pest_control                 weed killer         8  23.99
8  Staten Island       planter  20 inch terracotta planter         0  17.99
9  Staten Island       planter      8 inch plastic planter        53   3.99

   in_stock
0      True
1      True
2      True
3      True
4     False
5      True
6      True
7      True
8     False
9      True

In [48]:
inventory.head(10)

,location,product_type,product_description,quantity,price,in_stock,total_value
0,Staten Island,seeds,daisy,4,6.99,True,27.96
1,Staten Island,seeds,calla lily,46,19.99,True,919.54
2,Staten Island,seeds,tomato,85,13.99,True,1189.15
3,Staten Island,garden tools,rake,4,13.99,True,55.96
4,Staten Island,garden tools,wheelbarrow,0,89.99,False,0.00
5,Staten Island,garden tools,spade,93,19.99,True,1859.07
6,Staten Island,pest_control,insect killer,74,12.99,True,961.26
7,Staten Island,pest_control,weed killer,8,23.99,True,191.92
8,Staten Island,planter,20 inch terracotta planter,0,17.99,False,0.00
9,Staten Island,planter,8 inch plastic planter,53,3.99,True,211.47